app/Controllers/Admin/Contact.php

    public function index()
    {
        $data['contacts']= $this->contactModel->select('contacts.id,contacts.name,contacts.email,contacts.phone,groups.name as group_name')
        ->join('groups','groups.group_id=group','left outer')->findAll();
---
SELECT `contacts`.`id`, `contacts`.`name`, `contacts`.`email`, `contacts`.`phone`, `groups`.`name` as `group_name`
FROM `contacts`
LEFT OUTER JOIN `groups` ON `groups`.`group_id`=`group`

    public function add()
    {
        $groups = new Group();
        $data['groups'] = $groups->findAll();
        $data["title"] = "Contact : Add";
        $data["page"] = "Add";
        if ($this->request->is('post')) {
            $rules = [
                'name' => 'required|min_length[3]|max_length[100]',
                'email' => 'required|valid_email',
                'phone' => 'required|regex_match[/^[0-9]{10}$/]',
                'group' => 'required',
            ];

            if ($this->validate($rules)) {
                $data = [
                    'name' => $this->request->getVar('name'),
                    'email' => $this->request->getVar('email'),
                    'phone' => $this->request->getVar('phone'),
                    'group' => $this->request->getVar('group')
                ];
                $this->contactModel->save($data);
---
SELECT *
FROM `groups`
INSERT INTO `contacts` (`name`, `email`, `phone`, `group`) VALUES ('newUser', 'newuser@gmail.com', '8003051520', '1')

    public function show($id)
    {
        $data['contact'] = $this->contactModel->select('contacts.name,contacts.email,contacts.phone,groups.name as group_name')->join('groups', 'group_id=group', 'contacts')->find($id);
---
SELECT `contacts`.`name`, `contacts`.`email`, `contacts`.`phone`, `groups`.`name` as `group_name`
FROM `contacts`
JOIN `groups` ON `group_id`=`group`
WHERE `contacts`.`id` = '5'

    public function edit($id)
    {
        $data['contact'] = $this->contactModel->find($id);
        if ($this->request->is('put')) {
            extract($this->request->getRawInput());
            $rules = [
                'name' => 'required|min_length[3]|max_length[100]',
                'email' => 'required|valid_email',
                'phone' => 'required|regex_match[/^[0-9]{10}$/]',
                'group' => 'required',
            ];
            if ($this->validate($rules)) {
                $data = [
                    'name' => $name,
                    'email' => $email,
                    'phone' => $phone,
                    'group' => $group
                ];
                $this->contactModel->update($id, $data);
                $this->session->setFlashdata('message', 'Contact updated Successfully');
                $this->session->setFlashdata('alert-class', 'success');
                return redirect()->to('admin/contacts/manage');
            } else {
                $data['validator'] = $this->validator->getErrors();
            }
        }
        $groups = new Group();
        $data['groups'] = $groups->findAll();
---
SELECT *
FROM `contacts`
WHERE `contacts`.`id` = '5'
UPDATE `contacts` SET `name` = 'newUser', `email` = 'newuser@gmail.com', `phone` = '8003051520', `group` = '1'
WHERE `contacts`.`id` IN ('5')
SELECT *
FROM `groups`