app/Controllers/Admin/Group.php

INSERT INTO `groups` (`name`) VALUES ('Twitter')
---
    public function add()
    {
        if ($this->request->is('post')) {
            $rules = [
                'name' => 'required|min_length[3]',
            ];
            if ($this->validate($rules)) {
                $data = [
                    'name' => $this->request->getVar('name')
                ];
                $this->groupModel->save($data);

SELECT *
FROM `groups`
WHERE `groups`.`group_id` = '1'
---
    public function show($id)
    {

        $data['group']= $this->groupModel->find($id);