app/Controllers/Admin/Users.php

SELECT *
FROM `users`
---
    public function Index()
    {

        $Users = new User();
        $data['total_employee'] = $Users->findAll();