app/Models/Group.php

    public function getGroups($id = false)
    {
        if ($id === false) {
            return $this->findAll();
---
SELECT *
FROM `groups`